{
  "genres": [
    {
      "name": "Pop",
      "description": "Popular music with catchy melodies and simple track structures, appealing to a wide audience."
    },
    {
      "name": "Rock",
      "description": "Energetic and powerful music with strong rhythms and a guitar-driven sound."
    },
    {
      "name": "Hip Hop",
      "description": "Rap and hip-hop music featuring rhythmic beats and often spoken word lyrics."
    },
    {
      "name": "Country",
      "description": "Country music with traditional themes and characteristic instrumentation."
    },
    {
      "name": "Jazz",
      "description": "Jazz music that uniquely blends blues, swing, and bebop rhythms."
    },
    {
      "name": "Electronic",
      "description": "Electronic music characterized by unique electronic beats and rhythms."
    },
    {
      "name": "R&B",
      "description": "R&B music featuring a diverse blend of unique rhythms."
    },
    {
      "name": "Blues",
      "description": "Blues music with deep emotional tones and characteristic rhythms."
    },
    {
      "name": "Chill",
      "description": "Chill music that creates a relaxing atmosphere with gentle rhythms."
    },
    {
      "name": "Soul",
      "description": "Soul music filled with emotional sound and deep rhythms."
    },
    {
      "name": "K-Pop",
      "description": "K-Pop music featuring catchy melodies and distinctive styles."
    },
    {
      "name": "Latin",
      "description": "Latin music with lively rhythms and characteristic cultural influences."
    },
    {
      "name": "Dance",
      "description": "Dance music featuring vibrant melodies suitable for dancing."
    },
    {
      "name": "Metal",
      "description": "Metal music characterized by powerful sounds and high-energy rhythms."
    },
    {
      "name": "Indie",
      "description": "Indie music with a unique sound and creative style."
    },
    {
      "name": "Folk & Acoustic",
      "description": "Folk music featuring simple melodies and acoustic instruments."
    },
    {
      "name": "Sleep",
      "description": "Music designed for sleep, featuring soothing sounds to promote relaxation."
    },
    {
      "name": "Workout",
      "description": "Music for workouts with strong rhythms that encourage movement."
    },
    {
      "name": "Focus",
      "description": "Music designed for focus, featuring steady rhythms and soft melodies."
    }
  ]
}
